Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4SD16B.xml
    <module caption="Cortex M Cache Controller" name="CMCC" version="11108C">
      <register-group name="CMCC">
        <register caption="Cache Type Register" name="CMCC_TYPE" offset="0x00" rw="R" size="4">
          <bitfield caption="Access Port Access Allowed" mask="0x00000001" name="AP"/>
          <bitfield caption="Dynamic Clock Gating Supported" mask="0x00000002" name="GCLK"/>
          <bitfield caption="Random Selection Policy Supported" mask="0x00000004" name="RANDP"/>
          <bitfield caption="Least Recently Used Policy Supported" mask="0x00000008" name="LRUP"/>
          <bitfield caption="Random Selection Policy Supported" mask="0x00000010" name="RRP"/>
          <bitfield caption="Number of Way" mask="0x00000060" name="WAYNUM" values="CMCC_TYPE__WAYNUM"/>
          <bitfield caption="Lock Down Supported" mask="0x00000080" name="LCKDOWN"/>
          <bitfield caption="Cache Size" mask="0x00000700" name="CSIZE" values="CMCC_TYPE__CSIZE"/>
          <bitfield caption="Cache Size" mask="0x00003800" name="CLSIZE" values="CMCC_TYPE__CLSIZE"/>
        </register>
        <register caption="Cache Configuration Register" name="CMCC_CFG" offset="0x04" rw="RW" size="4">
          <bitfield caption="Disable Clock Gating" mask="0x00000001" name="GCLKDIS"/>
        </register>
        <register caption="Cache Control Register" name="CMCC_CTRL" offset="0x08" rw="W" size="4">
          <bitfield caption="Cache Controller Enable" mask="0x00000001" name="CEN"/>
        </register>
        <register caption="Cache Status Register" name="CMCC_SR" offset="0x0C" rw="R" size="4">
          <bitfield caption="Cache Controller Status" mask="0x00000001" name="CSTS"/>
        </register>
        <register caption="Cache Maintenance Register 0" name="CMCC_MAINT0" offset="0x20" rw="W" size="4">
          <bitfield caption="Cache Controller Invalidate All" mask="0x00000001" name="INVALL"/>
        </register>
        <register caption="Cache Maintenance Register 1" name="CMCC_MAINT1" offset="0x24" rw="W" size="4">
          <bitfield caption="Invalidate Index" mask="0x000001F0" name="INDEX"/>
          <bitfield caption="Invalidate Way" mask="0xC0000000" name="WAY" values="CMCC_MAINT1__WAY"/>
        </register>
        <register caption="Cache Monitor Configuration Register" name="CMCC_MCFG" offset="0x28" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Counter Mode" mask="0x00000003" name="MODE" values="CMCC_MCFG__MODE"/>
        </register>
        <register caption="Cache Monitor Enable Register" name="CMCC_MEN" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Cache Controller Monitor Enable" mask="0x00000001" name="MENABLE"/>
        </register>
        <register caption="Cache Monitor Control Register" name="CMCC_MCTRL" offset="0x30" rw="W" size="4">
          <bitfield caption="Monitor" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Cache Monitor Status Register" name="CMCC_MSR" offset="0x34" rw="R" size="4">
          <bitfield caption="Monitor Event Counter" mask="0xFFFFFFFF" name="EVENT_CNT"/>
        </register>
      </register-group>
      <value-group caption="" name="CMCC_TYPE__WAYNUM">
        <value caption="Direct Mapped Cache" name="DMAPPED" value="0x0"/>
        <value caption="2-WAY set associative" name="ARCH2WAY" value="0x1"/>
        <value caption="4-WAY set associative" name="ARCH4WAY" value="0x2"/>
        <value caption="8-WAY set associative" name="ARCH8WAY" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_TYPE__CSIZE">
        <value caption="Cache Size 1 Kbytes" name="CSIZE_1KB" value="0x0"/>
        <value caption="Cache Size 2 Kbytes" name="CSIZE_2KB" value="0x1"/>
        <value caption="Cache Size 4 Kbytes" name="CSIZE_4KB" value="0x2"/>
        <value caption="Cache Size 8 Kbytes" name="CSIZE_8KB" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_TYPE__CLSIZE">
        <value caption="4 Bytes" name="CLSIZE_1KB" value="0x0"/>
        <value caption="8 Bytes" name="CLSIZE_2KB" value="0x1"/>
        <value caption="16 Bytes" name="CLSIZE_4KB" value="0x2"/>
        <value caption="32 Bytes" name="CLSIZE_8KB" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_MAINT1__WAY">
        <value caption="Way 0 is selection for index invalidation" name="WAY0" value="0x0"/>
        <value caption="Way 1 is selection for index invalidation" name="WAY1" value="0x1"/>
        <value caption="Way 2 is selection for index invalidation" name="WAY2" value="0x2"/>
        <value caption="Way 3 is selection for index invalidation" name="WAY3" value="0x3"/>
      </value-group>
      <value-group caption="" name="CMCC_MCFG__MODE">
        <value caption="Cycle counter" name="CYCLE_COUNT" value="0x0"/>
        <value caption="Instruction hit counter" name="IHIT_COUNT" value="0x1"/>
        <value caption="Data hit counter" name="DHIT_COUNT" value="0x2"/>
      </value-group>
    </module>
    <module caption="Cyclic Redundancy Check Calculation Unit" name="CRCCU" version="11001F">
      <register-group name="CRCCU">
        <register caption="CRCCU Descriptor Base Register" name="CRCCU_DSCR" offset="0x000" rw="RW" size="4">
          <bitfield caption="Descriptor Base Address" mask="0xFFFFFE00" name="DSCR"/>
        </register>
        <register caption="CRCCU DMA Enable Register" name="CRCCU_DMA_EN" offset="0x008" rw="W" size="4">
          <bitfield caption="DMA Enable Register" mask="0x00000001" name="DMAEN"/>
        </register>
        <register caption="CRCCU DMA Disable Register" name="CRCCU_DMA_DIS" offset="0x00C" rw="W" size="4">
          <bitfield caption="DMA Disable Register" mask="0x00000001" name="DMADIS"/>
        </register>
        <register caption="CRCCU DMA Status Register" name="CRCCU_DMA_SR" offset="0x010" rw="R" size="4">
          <bitfield caption="DMA Status Register" mask="0x00000001" name="DMASR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Enable Register" name="CRCCU_DMA_IER" offset="0x014" rw="W" size="4">
          <bitfield caption="Interrupt Enable register" mask="0x00000001" name="DMAIER"/>
        </register>
        <register caption="CRCCU DMA Interrupt Disable Register" name="CRCCU_DMA_IDR" offset="0x018" rw="W" size="4">
          <bitfield caption="Interrupt Disable register" mask="0x00000001" name="DMAIDR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Mask Register" name="CRCCU_DMA_IMR" offset="0x001C" rw="R" size="4">
          <bitfield caption="Interrupt Mask Register" mask="0x00000001" name="DMAIMR"/>
        </register>
        <register caption="CRCCU DMA Interrupt Status Register" name="CRCCU_DMA_ISR" offset="0x020" rw="R" size="4">
          <bitfield caption="Interrupt Status register" mask="0x00000001" name="DMAISR"/>
        </register>
        <register caption="CRCCU Control Register" name="CRCCU_CR" offset="0x034" rw="W" size="4">
          <bitfield caption="CRC Computation Reset" mask="0x00000001" name="RESET"/>
        </register>
        <register caption="CRCCU Mode Register" name="CRCCU_MR" offset="0x038" rw="RW" size="4">
          <bitfield caption="CRC Enable" mask="0x00000001" name="ENABLE"/>
          <bitfield caption="CRC Compare" mask="0x00000002" name="COMPARE"/>
          <bitfield caption="Primitive Polynomial" mask="0x0000000C" name="PTYPE" values="CRCCU_MR__PTYPE"/>
          <bitfield caption="Request Divider" mask="0x000000F0" name="DIVIDER"/>
        </register>
        <register caption="CRCCU Status Register" name="CRCCU_SR" offset="0x03C" rw="R" size="4">
          <bitfield caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF" name="CRC"/>
        </register>
