Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4SD16B.xml
        <register caption="Data Timeout Register" name="HSMCI_DTOR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Data Timeout Cycle Number" mask="0x0000000F" name="DTOCYC"/>
          <bitfield caption="Data Timeout Multiplier" mask="0x00000070" name="DTOMUL" values="HSMCI_DTOR__DTOMUL"/>
        </register>
        <register caption="SD/SDIO Card Register" name="HSMCI_SDCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="SDCard/SDIO Slot" mask="0x00000003" name="SDCSEL" values="HSMCI_SDCR__SDCSEL"/>
          <bitfield caption="SDCard/SDIO Bus Width" mask="0x000000C0" name="SDCBUS" values="HSMCI_SDCR__SDCBUS"/>
        </register>
        <register caption="Argument Register" name="HSMCI_ARGR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Command Argument" mask="0xFFFFFFFF" name="ARG"/>
        </register>
        <register caption="Command Register" name="HSMCI_CMDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Command Number" mask="0x0000003F" name="CMDNB"/>
          <bitfield caption="Response Type" mask="0x000000C0" name="RSPTYP" values="HSMCI_CMDR__RSPTYP"/>
          <bitfield caption="Special Command" mask="0x00000700" name="SPCMD" values="HSMCI_CMDR__SPCMD"/>
          <bitfield caption="Open Drain Command" mask="0x00000800" name="OPDCMD" values="HSMCI_CMDR__OPDCMD"/>
          <bitfield caption="Max Latency for Command to Response" mask="0x00001000" name="MAXLAT" values="HSMCI_CMDR__MAXLAT"/>
          <bitfield caption="Transfer Command" mask="0x00030000" name="TRCMD" values="HSMCI_CMDR__TRCMD"/>
          <bitfield caption="Transfer Direction" mask="0x00040000" name="TRDIR" values="HSMCI_CMDR__TRDIR"/>
          <bitfield caption="Transfer Type" mask="0x00380000" name="TRTYP" values="HSMCI_CMDR__TRTYP"/>
          <bitfield caption="SDIO Special Command" mask="0x03000000" name="IOSPCMD" values="HSMCI_CMDR__IOSPCMD"/>
          <bitfield caption="ATA with Command Completion Signal" mask="0x04000000" name="ATACS" values="HSMCI_CMDR__ATACS"/>
          <bitfield caption="Boot Operation Acknowledge" mask="0x08000000" name="BOOT_ACK"/>
        </register>
        <register caption="Block Register" name="HSMCI_BLKR" offset="0x18" rw="RW" size="4">
          <bitfield caption="MMC/SDIO Block Count - SDIO Byte Count" mask="0x0000FFFF" name="BCNT"/>
          <bitfield caption="Data Block Length" mask="0xFFFF0000" name="BLKLEN"/>
        </register>
        <register caption="Completion Signal Timeout Register" name="HSMCI_CSTOR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Completion Signal Timeout Cycle Number" mask="0x0000000F" name="CSTOCYC"/>
          <bitfield caption="Completion Signal Timeout Multiplier" mask="0x00000070" name="CSTOMUL" values="HSMCI_CSTOR__CSTOMUL"/>
        </register>
        <register caption="Response Register 0" name="HSMCI_RSPR0" offset="0x20" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
        <register caption="Response Register 1" name="HSMCI_RSPR1" offset="0x24" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
        <register caption="Response Register 2" name="HSMCI_RSPR2" offset="0x28" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
        <register caption="Response Register 3" name="HSMCI_RSPR3" offset="0x2C" rw="R" size="4">
          <bitfield caption="Response" mask="0xFFFFFFFF" name="RSP"/>
        </register>
        <register caption="Receive Data Register" name="HSMCI_RDR" offset="0x30" rw="R" size="4">
          <bitfield caption="Data to Read" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Transmit Data Register" name="HSMCI_TDR" offset="0x34" rw="W" size="4">
          <bitfield caption="Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Status Register" name="HSMCI_SR" offset="0x40" rw="R" size="4">
          <bitfield caption="Command Ready" mask="0x00000001" name="CMDRDY"/>
          <bitfield caption="Receiver Ready" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Ready" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Data Block Ended" mask="0x00000008" name="BLKE"/>
          <bitfield caption="Data Transfer in Progress" mask="0x00000010" name="DTIP"/>
          <bitfield caption="HSMCI Not Busy" mask="0x00000020" name="NOTBUSY"/>
          <bitfield caption="End of RX Buffer" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="End of TX Buffer" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="SDIO Interrupt for Slot A" mask="0x00000100" name="SDIOIRQA"/>
          <bitfield caption="SDIO Read Wait Operation Status" mask="0x00001000" name="SDIOWAIT"/>
          <bitfield caption="CE-ATA Completion Signal Received" mask="0x00002000" name="CSRCV"/>
          <bitfield caption="RX Buffer Full" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Response Index Error" mask="0x00010000" name="RINDE"/>
          <bitfield caption="Response Direction Error" mask="0x00020000" name="RDIRE"/>
          <bitfield caption="Response CRC Error" mask="0x00040000" name="RCRCE"/>
          <bitfield caption="Response End Bit Error" mask="0x00080000" name="RENDE"/>
          <bitfield caption="Response Time-out Error" mask="0x00100000" name="RTOE"/>
          <bitfield caption="Data CRC Error" mask="0x00200000" name="DCRCE"/>
          <bitfield caption="Data Time-out Error" mask="0x00400000" name="DTOE"/>
          <bitfield caption="Completion Signal Time-out Error" mask="0x00800000" name="CSTOE"/>
          <bitfield caption="FIFO empty flag" mask="0x04000000" name="FIFOEMPTY"/>
          <bitfield caption="Transfer Done flag" mask="0x08000000" name="XFRDONE"/>
          <bitfield caption="Boot Operation Acknowledge Received" mask="0x10000000" name="ACKRCV"/>
          <bitfield caption="Boot Operation Acknowledge Error" mask="0x20000000" name="ACKRCVE"/>
          <bitfield caption="Overrun" mask="0x40000000" name="OVRE"/>
          <bitfield caption="Underrun" mask="0x80000000" name="UNRE"/>
        </register>
        <register caption="Interrupt Enable Register" name="HSMCI_IER" offset="0x44" rw="W" size="4">
          <bitfield caption="Command Ready Interrupt Enable" mask="0x00000001" name="CMDRDY"/>
          <bitfield caption="Receiver Ready Interrupt Enable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Data Block Ended Interrupt Enable" mask="0x00000008" name="BLKE"/>
          <bitfield caption="Data Transfer in Progress Interrupt Enable" mask="0x00000010" name="DTIP"/>
          <bitfield caption="Data Not Busy Interrupt Enable" mask="0x00000020" name="NOTBUSY"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="SDIO Interrupt for Slot A Interrupt Enable" mask="0x00000100" name="SDIOIRQA"/>
          <bitfield caption="SDIO Read Wait Operation Status Interrupt Enable" mask="0x00001000" name="SDIOWAIT"/>
          <bitfield caption="Completion Signal Received Interrupt Enable" mask="0x00002000" name="CSRCV"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Response Index Error Interrupt Enable" mask="0x00010000" name="RINDE"/>
          <bitfield caption="Response Direction Error Interrupt Enable" mask="0x00020000" name="RDIRE"/>
          <bitfield caption="Response CRC Error Interrupt Enable" mask="0x00040000" name="RCRCE"/>
          <bitfield caption="Response End Bit Error Interrupt Enable" mask="0x00080000" name="RENDE"/>
          <bitfield caption="Response Time-out Error Interrupt Enable" mask="0x00100000" name="RTOE"/>
          <bitfield caption="Data CRC Error Interrupt Enable" mask="0x00200000" name="DCRCE"/>
          <bitfield caption="Data Time-out Error Interrupt Enable" mask="0x00400000" name="DTOE"/>
          <bitfield caption="Completion Signal Timeout Error Interrupt Enable" mask="0x00800000" name="CSTOE"/>
          <bitfield caption="FIFO empty Interrupt enable" mask="0x04000000" name="FIFOEMPTY"/>
          <bitfield caption="Transfer Done Interrupt enable" mask="0x08000000" name="XFRDONE"/>
          <bitfield caption="Boot Acknowledge Interrupt Enable" mask="0x10000000" name="ACKRCV"/>
          <bitfield caption="Boot Acknowledge Error Interrupt Enable" mask="0x20000000" name="ACKRCVE"/>
          <bitfield caption="Overrun Interrupt Enable" mask="0x40000000" name="OVRE"/>
          <bitfield caption="Underrun Interrupt Enable" mask="0x80000000" name="UNRE"/>
        </register>
        <register caption="Interrupt Disable Register" name="HSMCI_IDR" offset="0x48" rw="W" size="4">
          <bitfield caption="Command Ready Interrupt Disable" mask="0x00000001" name="CMDRDY"/>
          <bitfield caption="Receiver Ready Interrupt Disable" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Data Block Ended Interrupt Disable" mask="0x00000008" name="BLKE"/>
          <bitfield caption="Data Transfer in Progress Interrupt Disable" mask="0x00000010" name="DTIP"/>
          <bitfield caption="Data Not Busy Interrupt Disable" mask="0x00000020" name="NOTBUSY"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="SDIO Interrupt for Slot A Interrupt Disable" mask="0x00000100" name="SDIOIRQA"/>
          <bitfield caption="SDIO Read Wait Operation Status Interrupt Disable" mask="0x00001000" name="SDIOWAIT"/>
          <bitfield caption="Completion Signal received interrupt Disable" mask="0x00002000" name="CSRCV"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Response Index Error Interrupt Disable" mask="0x00010000" name="RINDE"/>
          <bitfield caption="Response Direction Error Interrupt Disable" mask="0x00020000" name="RDIRE"/>
          <bitfield caption="Response CRC Error Interrupt Disable" mask="0x00040000" name="RCRCE"/>
          <bitfield caption="Response End Bit Error Interrupt Disable" mask="0x00080000" name="RENDE"/>
          <bitfield caption="Response Time-out Error Interrupt Disable" mask="0x00100000" name="RTOE"/>
          <bitfield caption="Data CRC Error Interrupt Disable" mask="0x00200000" name="DCRCE"/>
          <bitfield caption="Data Time-out Error Interrupt Disable" mask="0x00400000" name="DTOE"/>
          <bitfield caption="Completion Signal Time out Error Interrupt Disable" mask="0x00800000" name="CSTOE"/>
          <bitfield caption="FIFO empty Interrupt Disable" mask="0x04000000" name="FIFOEMPTY"/>
          <bitfield caption="Transfer Done Interrupt Disable" mask="0x08000000" name="XFRDONE"/>
          <bitfield caption="Boot Acknowledge Interrupt Disable" mask="0x10000000" name="ACKRCV"/>
          <bitfield caption="Boot Acknowledge Error Interrupt Disable" mask="0x20000000" name="ACKRCVE"/>
          <bitfield caption="Overrun Interrupt Disable" mask="0x40000000" name="OVRE"/>
          <bitfield caption="Underrun Interrupt Disable" mask="0x80000000" name="UNRE"/>
        </register>
        <register caption="Interrupt Mask Register" name="HSMCI_IMR" offset="0x4C" rw="R" size="4">
          <bitfield caption="Command Ready Interrupt Mask" mask="0x00000001" name="CMDRDY"/>
          <bitfield caption="Receiver Ready Interrupt Mask" mask="0x00000002" name="RXRDY"/>
          <bitfield caption="Transmit Ready Interrupt Mask" mask="0x00000004" name="TXRDY"/>
          <bitfield caption="Data Block Ended Interrupt Mask" mask="0x00000008" name="BLKE"/>
          <bitfield caption="Data Transfer in Progress Interrupt Mask" mask="0x00000010" name="DTIP"/>
          <bitfield caption="Data Not Busy Interrupt Mask" mask="0x00000020" name="NOTBUSY"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00000040" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000080" name="ENDTX"/>
          <bitfield caption="SDIO Interrupt for Slot A Interrupt Mask" mask="0x00000100" name="SDIOIRQA"/>
          <bitfield caption="SDIO Read Wait Operation Status Interrupt Mask" mask="0x00001000" name="SDIOWAIT"/>
          <bitfield caption="Completion Signal Received Interrupt Mask" mask="0x00002000" name="CSRCV"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00004000" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00008000" name="TXBUFE"/>
          <bitfield caption="Response Index Error Interrupt Mask" mask="0x00010000" name="RINDE"/>
          <bitfield caption="Response Direction Error Interrupt Mask" mask="0x00020000" name="RDIRE"/>
          <bitfield caption="Response CRC Error Interrupt Mask" mask="0x00040000" name="RCRCE"/>
          <bitfield caption="Response End Bit Error Interrupt Mask" mask="0x00080000" name="RENDE"/>
          <bitfield caption="Response Time-out Error Interrupt Mask" mask="0x00100000" name="RTOE"/>
          <bitfield caption="Data CRC Error Interrupt Mask" mask="0x00200000" name="DCRCE"/>
          <bitfield caption="Data Time-out Error Interrupt Mask" mask="0x00400000" name="DTOE"/>
          <bitfield caption="Completion Signal Time-out Error Interrupt Mask" mask="0x00800000" name="CSTOE"/>
          <bitfield caption="FIFO Empty Interrupt Mask" mask="0x04000000" name="FIFOEMPTY"/>
          <bitfield caption="Transfer Done Interrupt Mask" mask="0x08000000" name="XFRDONE"/>
          <bitfield caption="Boot Operation Acknowledge Received Interrupt Mask" mask="0x10000000" name="ACKRCV"/>
          <bitfield caption="Boot Operation Acknowledge Error Interrupt Mask" mask="0x20000000" name="ACKRCVE"/>
          <bitfield caption="Overrun Interrupt Mask" mask="0x40000000" name="OVRE"/>
          <bitfield caption="Underrun Interrupt Mask" mask="0x80000000" name="UNRE"/>
        </register>
        <register caption="Configuration Register" name="HSMCI_CFG" offset="0x54" rw="RW" size="4">
          <bitfield caption="HSMCI Internal FIFO control mode" mask="0x00000001" name="FIFOMODE"/>
          <bitfield caption="Flow Error flag reset control mode" mask="0x00000010" name="FERRCTRL"/>
          <bitfield caption="High Speed Mode" mask="0x00000100" name="HSMODE"/>
          <bitfield caption="Synchronize on the last block" mask="0x00001000" name="LSYNC"/>
        </register>
        <register caption="Write Protection Mode Register" name="HSMCI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect Key" mask="0xFFFFFF00" name="WPKEY" values="HSMCI_WPMR__WPKEY"/>
        </register>
