Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4SD16B.xml
        <register caption="FIFO Memory Aperture0 54" name="HSMCI_FIFO54" offset="0x2D8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 55" name="HSMCI_FIFO55" offset="0x2DC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 56" name="HSMCI_FIFO56" offset="0x2E0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 57" name="HSMCI_FIFO57" offset="0x2E4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 58" name="HSMCI_FIFO58" offset="0x2E8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 59" name="HSMCI_FIFO59" offset="0x2EC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 60" name="HSMCI_FIFO60" offset="0x2F0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 61" name="HSMCI_FIFO61" offset="0x2F4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 62" name="HSMCI_FIFO62" offset="0x2F8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 63" name="HSMCI_FIFO63" offset="0x2FC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 64" name="HSMCI_FIFO64" offset="0x300" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 65" name="HSMCI_FIFO65" offset="0x304" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 66" name="HSMCI_FIFO66" offset="0x308" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 67" name="HSMCI_FIFO67" offset="0x30C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 68" name="HSMCI_FIFO68" offset="0x310" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 69" name="HSMCI_FIFO69" offset="0x314" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 70" name="HSMCI_FIFO70" offset="0x318" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 71" name="HSMCI_FIFO71" offset="0x31C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 72" name="HSMCI_FIFO72" offset="0x320" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 73" name="HSMCI_FIFO73" offset="0x324" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 74" name="HSMCI_FIFO74" offset="0x328" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 75" name="HSMCI_FIFO75" offset="0x32C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 76" name="HSMCI_FIFO76" offset="0x330" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 77" name="HSMCI_FIFO77" offset="0x334" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 78" name="HSMCI_FIFO78" offset="0x338" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 79" name="HSMCI_FIFO79" offset="0x33C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 80" name="HSMCI_FIFO80" offset="0x340" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 81" name="HSMCI_FIFO81" offset="0x344" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 82" name="HSMCI_FIFO82" offset="0x348" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 83" name="HSMCI_FIFO83" offset="0x34C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 84" name="HSMCI_FIFO84" offset="0x350" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 85" name="HSMCI_FIFO85" offset="0x354" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 86" name="HSMCI_FIFO86" offset="0x358" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 87" name="HSMCI_FIFO87" offset="0x35C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 88" name="HSMCI_FIFO88" offset="0x360" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 89" name="HSMCI_FIFO89" offset="0x364" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 90" name="HSMCI_FIFO90" offset="0x368" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 91" name="HSMCI_FIFO91" offset="0x36C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 92" name="HSMCI_FIFO92" offset="0x370" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 93" name="HSMCI_FIFO93" offset="0x374" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 94" name="HSMCI_FIFO94" offset="0x378" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 95" name="HSMCI_FIFO95" offset="0x37C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 96" name="HSMCI_FIFO96" offset="0x380" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 97" name="HSMCI_FIFO97" offset="0x384" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 98" name="HSMCI_FIFO98" offset="0x388" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 99" name="HSMCI_FIFO99" offset="0x38C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 100" name="HSMCI_FIFO100" offset="0x390" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 101" name="HSMCI_FIFO101" offset="0x394" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 102" name="HSMCI_FIFO102" offset="0x398" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 103" name="HSMCI_FIFO103" offset="0x39C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 104" name="HSMCI_FIFO104" offset="0x3A0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 105" name="HSMCI_FIFO105" offset="0x3A4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 106" name="HSMCI_FIFO106" offset="0x3A8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 107" name="HSMCI_FIFO107" offset="0x3AC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 108" name="HSMCI_FIFO108" offset="0x3B0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 109" name="HSMCI_FIFO109" offset="0x3B4" rw="RW" size="4"/>
